NextFOAM-2506/tutorials/lagrangian/simpleReactingParcelFoam/verticalChannel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    // front vertices
    ( 0.00000e+00 -2.30000e+02  2.50000e+01) // v0 0
    ( 0.00000e+00 -3.00000e+01  2.50000e+01) // v1 1
    ( 0.00000e+00  0.00000e+00  2.50000e+01) // v2 2
    ( 0.00000e+00  1.05000e+03  2.50000e+01) // v3 3
    ( 9.00000e+00  1.05000e+03  2.50000e+01) // v4 4
    ( 1.60000e+01  1.05000e+03  2.50000e+01) // v5 5
    ( 2.50000e+01  1.05000e+03  2.50000e+01) // v6 6
    ( 2.50000e+01  0.00000e+00  2.50000e+01) // v7 7
    ( 2.50000e+01 -3.00000e+01  2.50000e+01) // v8 8
    ( 2.50000e+01 -2.30000e+02  2.50000e+01) // v9 9
    ( 1.80000e+01 -2.30000e+02  2.50000e+01) // v10 10
    ( 1.80000e+01 -3.00000e+01  2.50000e+01) // v11 11
    ( 1.60000e+01  0.00000e+00  2.50000e+01) // v12 12
    ( 1.60000e+01 -2.30000e+02  2.50000e+01) // v13 13
    ( 9.00000e+00 -2.30000e+02  2.50000e+01) // v14 14
    ( 9.00000e+00  0.00000e+00  2.50000e+01) // v15 15
    ( 7.00000e+00 -3.00000e+01  2.50000e+01) // v16 16
    ( 7.00000e+00 -2.30000e+02  2.50000e+01) // v17 17

    // back vertices
    ( 0.00000e+00 -2.30000e+02 -2.50000e+01) // v0 18
    ( 0.00000e+00 -3.00000e+01 -2.50000e+01) // v1 19
    ( 0.00000e+00  0.00000e+00 -2.50000e+01) // v2 20
    ( 0.00000e+00  1.05000e+03 -2.50000e+01) // v3 21
    ( 9.00000e+00  1.05000e+03 -2.50000e+01) // v4 22
    ( 1.60000e+01  1.05000e+03 -2.50000e+01) // v5 23
    ( 2.50000e+01  1.05000e+03 -2.50000e+01) // v6 24
    ( 2.50000e+01  0.00000e+00 -2.50000e+01) // v7 25
    ( 2.50000e+01 -3.00000e+01 -2.50000e+01) // v8 26
    ( 2.50000e+01 -2.30000e+02 -2.50000e+01) // v9 27
    ( 1.80000e+01 -2.30000e+02 -2.50000e+01) // v10 28
    ( 1.80000e+01 -3.00000e+01 -2.50000e+01) // v11 29
    ( 1.60000e+01  0.00000e+00 -2.50000e+01) // v12 30
    ( 1.60000e+01 -2.30000e+02 -2.50000e+01) // v13 31
    ( 9.00000e+00 -2.30000e+02 -2.50000e+01) // v14 32
    ( 9.00000e+00  0.00000e+00 -2.50000e+01) // v15 33
    ( 7.00000e+00 -3.00000e+01 -2.50000e+01) // v16 34
    ( 7.00000e+00 -2.30000e+02 -2.50000e+01) // v17 35
);

edges
(
);

blocks
(
    // block 0
    hex (0 1 16 17 18 19 34 35)
    (67 10 10)
    edgeGrading
    (
         1.00000e+00  1.00000e+00  1.00000e+00  1.00000e+00
         1.00000e+00  1.00000e+00  1.00000e+00  1.00000e+00
         1.00000e+00  1.00000e+00  1.00000e+00  1.00000e+00
    )

    // block 1
    hex (1 2 15 16 19 20 33 34)
    (10 10 10)
    edgeGrading
    (
         1.00000e+00  1.00000e+00  1.00000e+00  1.00000e+00
         1.00000e+00  1.00000e+00  1.00000e+00  1.00000e+00
         1.00000e+00  1.00000e+00  1.00000e+00  1.00000e+00
    )

    // block 2
    hex (2 3 4 15 20 21 22 33)
    (234 10 10)
    edgeGrading
    (
         4.00000e+00  4.00000e+00  4.00000e+00  4.00000e+00
         1.00000e+00  1.00000e+00  1.00000e+00  1.00000e+00
         1.00000e+00  1.00000e+00  1.00000e+00  1.00000e+00
    )

    // block 3
    hex (14 15 12 13 32 33 30 31)
    (77 10 10)
    edgeGrading
    (
         1.00000e+00  1.00000e+00  1.00000e+00  1.00000e+00
         1.00000e+00  1.00000e+00  1.00000e+00  1.00000e+00
         1.00000e+00  1.00000e+00  1.00000e+00  1.00000e+00
    )

    // block 4
    hex (15 4 5 12 33 22 23 30)
    (234 10 10)
    edgeGrading
    (
         4.00000e+00  4.00000e+00  4.00000e+00  4.00000e+00
         1.00000e+00  1.00000e+00  1.00000e+00  1.00000e+00
         1.00000e+00  1.00000e+00  1.00000e+00  1.00000e+00
    )

    // block 5
    hex (10 11 8 9 28 29 26 27)
    (67 10 10)
    edgeGrading
    (
         1.00000e+00  1.00000e+00  1.00000e+00  1.00000e+00
         1.00000e+00  1.00000e+00  1.00000e+00  1.00000e+00
         1.00000e+00  1.00000e+00  1.00000e+00  1.00000e+00
    )

    // block 6
    hex (11 12 7 8 29 30 25 26)
    (11 10 10)
    edgeGrading
    (
         1.00000e+00  1.00000e+00  1.00000e+00  1.00000e+00
         1.00000e+00  1.00000e+00  1.00000e+00  1.00000e+00
         1.00000e+00  1.00000e+00  1.00000e+00  1.00000e+00
    )

    // block 7
    hex (12 5 6 7 30 23 24 25)
    (234 10 10)
    edgeGrading
    (
         4.00000e+00  4.00000e+00  4.00000e+00  4.00000e+00
         1.00000e+00  1.00000e+00  1.00000e+00  1.00000e+00
         1.00000e+00  1.00000e+00  1.00000e+00  1.00000e+00
    )

);

defaultPatch
{
    name walls;
    type wall;
}

boundary
(
    back
    {
        type symmetryPlane;
        faces
        (
            (0 1 16 17)
            (1 2 15 16)
            (2 3 4 15)
            (14 15 12 13)
            (15 4 5 12)
            (10 11 8 9)
            (11 12 7 8)
            (12 5 6 7)
        );
    }

    front
    {
        type symmetryPlane;
        faces
        (
            (18 19 34 35)
            (19 20 33 34)
            (20 21 22 33)
            (32 33 30 31)
            (33 22 23 30)
            (28 29 26 27)
            (29 30 25 26)
            (30 23 24 25)
        );
    }

    inletCentral
    {
        type patch;
        faces
        (
            (13 14 32 31)
        );
    }

    inletSides
    {
        type patch;
        faces
        (
            (17 0 18 35)
            (9 10 28 27)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (3 4 22 21)
            (4 5 23 22)
            (5 6 24 23)
        );
    }
);

// ************************************************************************* //
